demo_app/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."provider" = $1 AND "users"."uid" = $2 ORDER BY "users"."id" ASC LIMIT $3  [["provider", "google_oauth2"], ["uid", "110312932413612174310"], ["LIMIT", 1]]
INSERT INTO "users" ("provider", "uid", "name", "oauth_token", "auth_token", "oauth_expires_at", "email", "firstname", "lastname", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
UPDATE "users" SET "oauth_token" = $1, "oauth_expires_at" = $2, "updated_at" = $3 WHERE "users"."id" = $4
---
  def self.from_omniauth(auth)
    where(auth.slice(:provider, :uid)).first_or_initialize.tap do |user|
      user.provider = auth.dig('provider')
      user.uid = auth.dig('uid')
      user.email = auth.dig('info', 'email')
      user.firstname = auth.dig('info', 'first_name')
      user.lastname = auth.dig('info', 'last_name')
      user.name = auth.dig('info', 'name')
      user.oauth_token = auth.dig('credentials', 'token')
      user.oauth_expires_at = Time.at(auth.dig('credentials', 'expires_at'))
      user.save!