demo_app/app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def logged_in?
    if session[:user_id].blank?
    	flash[:error] = "You must be logged in access the section"
    	redirect_to login_path
    else
    	@current_user ||= User.find(session[:user_id]) if session[:user_id]