demo_app/app/controllers/appointments_controller.rb

  def index
    data = Appointment.all.map{|x| [x.patient.name, x.doctor.name, x.diseases]}
---
SELECT  "doctors".* FROM "doctors" WHERE "doctors"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT  "patients".* FROM "patients" WHERE "patients"."id" = $1 LIMIT $2  [["id", 57], ["LIMIT", 1]]
SELECT "appointments".* FROM "appointments"

  def create
    appointment = Appointment.new(appointment_params)
    if appointment.save
---
INSERT INTO "appointments" ("diseases", "doctor_id", "patient_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["diseases", "adsfas"], ["doctor_id", 7], ["patient_id", 57], ["created_at", "2018-05-17 18:31:37.615876"], ["updated_at", "2018-05-17 18:31:37.615876"]]