demo_app/app/controllers/doctors_controller.rb

  def create
    doctor = Doctor.new(doctor_params)
    if doctor.save
---
INSERT INTO "doctors" ("name", "phone_no", "specialization", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "tert"], ["phone_no", "123"], ["specialization", "safdsf"], ["created_at", "2018-05-17 18:05:17.622743"], ["updated_at", "2018-05-17 18:05:17.622743"]]

  def index
    render json: {data: Doctor.pluck(:id, :name)}
---
SELECT "doctors"."id", "doctors"."name" FROM "doctors"