demo_app/app/controllers/patients_controller.rb

  def create
    @patient = Patient.new(patient_params)
    if @patient.save
---
INSERT INTO "patients" ("name", "phone_no", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Lokesh"], ["phone_no", "123"], ["created_at", "2018-05-17 17:39:08.158325"], ["updated_at", "2018-05-17 17:39:08.158325"]]

  def index
    render json: {data: Patient.pluck(:id, :name)}
---
SELECT "patients"."id", "patients"."name" FROM "patients"