demo_app/app/controllers/sessions_controller.rb

  def verify_login
    byebug
    user = User.where(login_params).first
    if user.present?
---
SELECT  "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]

  def create
    auth = request.env["omniauth.auth"]
    user = User.find_by_provider_and_uid(auth["provider"], auth["uid"]) || User.create_with_omniauth(auth)
---
INSERT INTO "users" ("provider", "uid", "name", "oauth_token", "auth_token", "oauth_expires_at", "email", "firstname", "lastname", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
SELECT  "users".* FROM "users" WHERE "users"."provider" = $1 AND "users"."uid" = $2 LIMIT $3  [["provider", "google_oauth2"], ["uid", "101785175156403824065"], ["LIMIT", 1]]